In [1]:
import pandas as pd
import numpy as np

In [6]:
s=pd.Series(['jayesh',1,3,'gtx','msi'])
s

0    jayesh
1         1
2         3
3       gtx
4       msi
dtype: object

In [7]:
s=pd.Series(['jayesh',1,3,'gtx','msi'],index=['name','no.','no.2','graphic','company'])
s

name       jayesh
no.             1
no.2            3
graphic       gtx
company       msi
dtype: object

In [8]:
n_s=pd.Series({'name':'jayesh','last_name':'kumar'})
n_s

name         jayesh
last_name     kumar
dtype: object

In [11]:
n_s['name']

'jayesh'

In [12]:
n_s['last_name']

'kumar'

In [13]:
n_s.index

Index(['name', 'last_name'], dtype='object')

In [14]:
n_s.index.name = "Info"
n_s.name = "Details"
n_s

Info
name         jayesh
last_name     kumar
Name: Details, dtype: object

In [15]:
bd = {'Firmicutes': 632, 'Proteobacteria': 1638, 'Actinobacteria': 569, 'Bacteroidetes': 115}
pd.Series(bd)

Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
dtype: int64

In [16]:
n_bd=pd.Series(bd, index=['Cyanobacteria','Firmicutes','Proteobacteria','Actinobacteria'])
n_bd

Cyanobacteria        NaN
Firmicutes         632.0
Proteobacteria    1638.0
Actinobacteria     569.0
dtype: float64

In [18]:
n_bd.isnull()

Cyanobacteria      True
Firmicutes        False
Proteobacteria    False
Actinobacteria    False
dtype: bool

In [19]:
bacteria = pd.Series([632, 1638, 569, 115], 
    index=['Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes'])

print(bacteria)
bacteria + n_bd

Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
dtype: int64

Actinobacteria    1138.0
Bacteroidetes        NaN
Cyanobacteria        NaN
Firmicutes        1264.0
Proteobacteria    3276.0
dtype: float64

In [22]:
newSeries = bacteria + n_bd
newSeries.isnull()

Actinobacteria    False
Bacteroidetes      True
Cyanobacteria      True
Firmicutes        False
Proteobacteria    False
dtype: bool

In [24]:
newSeries.notnull()

Actinobacteria     True
Bacteroidetes     False
Cyanobacteria     False
Firmicutes         True
Proteobacteria     True
dtype: bool

In [25]:
data = pd.DataFrame({'value':[632, 1638, 569, 115, 433, 1130, 754, 555],
                     'patient':[1, 1, 1, 1, 2, 2, 2, 2],
                     'phylum':['Firmicutes', 'Proteobacteria', 'Actinobacteria', 
    'Bacteroidetes', 'Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes']})
data

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

# TITANIC

In [265]:
d = pd.read_csv("C:\\Users\\Jayesh's\\Desktop\\Pyhton_Notebooks\\datasets\\titanic\\train.csv")
d.head(10)
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [266]:
d.columns
d.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [267]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [268]:
d.drop("Cabin",axis = 1, inplace=True)
d.drop("Ticket",axis = 1, inplace=True)
d.drop("Fare",axis = 1, inplace=True)
d.drop("PassengerId",axis = 1, inplace=True)
d.head(1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S

In [269]:
missing_age = pd.isnull(d['Age'])
d[missing_age].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked
5,0,3,"Moran, Mr. James",male,NaN,0,0,Q
17,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,S
19,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,C
26,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,C
28,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,Q

In [270]:
m_a_f = d[missing_age]['Sex'] == 'female'
m_a_m = d[missing_age]['Sex'] == 'male'
print(m_a_f.sum())
print(m_a_m.sum())

53
124

In [271]:
#title extraction
d['Title'] = d.Name.str.extract(' ([A-Za-z]+)\.', expand=False)
d['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'Countess',
       'Jonkheer'], dtype=object)

In [272]:
#Grouping titles
d['Title'] = d['Title'].replace(['Lady', 'Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Jonkheer', 'Dona'], 'Rare')   
d['Title'] = d['Title'].replace(['Countess', 'Lady', 'Sir'], 'Royal')
d['Title'] = d['Title'].replace('Mlle', 'Miss')
d['Title'] = d['Title'].replace('Ms', 'Miss')
d['Title'] = d['Title'].replace('Mme', 'Mrs')
d['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Rare', 'Royal'], dtype=object)

In [273]:
#Mapping titles
title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Royal": 5, "Rare": 6}
d['Title'] = d['Title'].map(title_mapping)
d['Title'] = d['Title'].fillna(0)
d.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked,Title
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C,3
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,S,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S,3
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,S,1

In [274]:
bins = [-1, 0, 5, 12, 18, 24, 35, 60, np.inf]
labels = ['Unknown', 'Baby', 'Child', 'Teenager', 'Student', 'Young Adult', 'Adult', 'Senior']
d['AgeGroup'] = pd.cut(d["Age"], bins, labels = labels)

In [275]:
mr_age = d[d["Title"] == 1]["AgeGroup"].mode() #Young Adult
miss_age = d[d["Title"] == 2]["AgeGroup"].mode() #Student
mrs_age = d[d["Title"] == 3]["AgeGroup"].mode() #Adult
master_age = d[d["Title"] == 4]["AgeGroup"].mode() #Baby
royal_age = d[d["Title"] == 5]["AgeGroup"].mode() #Adult
rare_age = d[d["Title"] == 6]["AgeGroup"].mode() #Adult

age_title_mapping = {1: "Young Adult", 2: "Student", 3: "Adult", 4: "Baby", 5: "Adult", 6: "Adult"}

for x in range(len(d["AgeGroup"])):
    if d["AgeGroup"][x] == "Unknown":
        d["AgeGroup"][x] = age_title_mapping[d["Title"][x]]

In [276]:
mean_ages = d.groupby(['Title'])['Age'].mean()

def remove_na_ages(row):
    if pd.isnull(row['Age']):
        return mean_ages[row['Title']]
    else:
        return row['Age']
d['Age'] =d.apply(remove_na_ages, axis=1)

In [277]:
d[missing_age].head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked,Title,AgeGroup
5,0,3,"Moran, Mr. James",male,32.368090,0,0,Q,1,NaN
17,1,2,"Williams, Mr. Charles Eugene",male,32.368090,0,0,S,1,NaN
19,1,3,"Masselmani, Mrs. Fatima",female,35.788991,0,0,C,3,NaN
26,0,3,"Emir, Mr. Farred Chehab",male,32.368090,0,0,C,1,NaN
28,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,21.845638,0,0,Q,2,NaN
29,0,3,"Todoroff, Mr. Lalio",male,32.368090,0,0,S,1,NaN
31,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,35.788991,1,0,C,3,NaN
32,1,3,"Glynn, Miss. Mary Agatha",female,21.845638,0,0,Q,2,NaN
36,1,3,"Mamee, Mr. Hanna",male,32.368090,0,0,C,1,NaN
42,0,3,"Kraeff, Mr. Theodor",male,32.368090,0,0,C,1,NaN

In [278]:
d.drop("AgeGroup",axis = 1, inplace=True)

In [279]:
missing_ports = d[d['Embarked'].isnull()]
missing_ports

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Embarked,Title
61,1,1,"Icard, Miss. Amelie",female,38.0,0,0,NaN,2
829,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,NaN,3

In [280]:
d['Embarked'].fillna('C',inplace=True)

In [281]:
d.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Embarked    0
Title       0
dtype: int64

In [282]:
from sklearn.preprocessing import LabelEncoder
cat_mask=(d.dtypes=='object')
cat_col=d.columns[cat_mask].tolist()
print(d[cat_col].head())
le=LabelEncoder()
d[cat_col]=d[cat_col].apply(lambda x:le.fit_transform(x))
print(d[cat_col].head())

                                                Name     Sex Embarked
0                            Braund, Mr. Owen Harris    male        S
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female        C
2                             Heikkinen, Miss. Laina  female        S
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female        S
4                           Allen, Mr. William Henry    male        S
   Name  Sex  Embarked
0   108    1         2
1   190    0         0
2   353    0         2
3   272    0         2
4    15    1         2

In [283]:
d.head()

   Survived  Pclass  Name  Sex   Age  SibSp  Parch  Embarked  Title
0         0       3   108    1  22.0      1      0         2      1
1         1       1   190    0  38.0      1      0         0      3
2         1       3   353    0  26.0      0      0         2      2
3         1       1   272    0  35.0      1      0         2      3
4         0       3    15    1  35.0      0      0         2      1

In [294]:
from sklearn.model_selection import train_test_split as t_t_s
X = d.drop("Survived",axis = 1)
y = d["Survived"]
X_train,X_test,y_train,y_test=t_t_s(X,y,test_size=0.23,random_state=50)

# Decision Tree

In [295]:
from sklearn.tree import DecisionTreeClassifier as dtc
dt=dtc()
dt.fit(X_train,y_train)
predictions=dt.predict(X_test)
dt.score(X_test,y_test)

0.8341463414634146

# XGBoost

In [302]:
import xgboost as xgb
xg_cl = xgb.XGBClassifier(objective='binary:logistic', n_estimators=15, seed=120)
xg_cl.fit(X_train,y_train)
preds = xg_cl.predict(X_test)
# Compute the accuracy: accuracy
accuracy = float(np.sum(preds==y_test))/y_test.shape[0]
print("accuracy:  ", (accuracy))

accuracy:   0.848780487804878

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

In [303]:
titanic = xgb.DMatrix(data=X,label=y)
tuned_params = {"objective":"reg:linear",'colsample_bytree': 0.3, 'learning_rate': 0.1, 'max_depth': 5}
tuned_cv_results_rmse = xgb.cv(dtrain=titanic, params=tuned_params, nfold=4, num_boost_round=200, metrics="rmse",as_pandas=True, seed=123)
print("Tuned rmse: %f" %((tuned_cv_results_rmse["test-rmse-mean"]).tail(1)))

Tuned rmse: 0.363893

# Random Forest

In [301]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import GridSearchCV
from sklearn.cross_validation import StratifiedKFold
parameter_gridsearch = {
                 'max_depth' : [3, 4],  #depth of each decision tree
                 'n_estimators': [50, 20],  #count of decision tree
                 'max_features': ['sqrt', 'auto', 'log2'],      
                 'min_samples_split': [2],      
                 'min_samples_leaf': [1, 3, 4],
                 'bootstrap': [True, False],
                 }
randomforest = RandomForestClassifier()
crossvalidation = StratifiedKFold(y , n_folds=5)

gridsearch = GridSearchCV(randomforest,             #grid search for algorithm optimization
                               scoring='accuracy',
                               param_grid=parameter_gridsearch,
                               cv=crossvalidation)


gridsearch.fit(X,y) 
model = gridsearch
parameters = gridsearch.best_params_
print('Best Score:{}'.format(gridsearch.best_score_))

Best Score:0.8294051627384961

# Knn Neighbors

In [299]:
from sklearn.preprocessing import StandardScaler as ss
from sklearn.neighbors import KNeighborsClassifier as kn
from sklearn.pipeline import Pipeline as pipe

scaler = ss()
knn = kn(n_neighbors = 20)

steps = [("scale",scaler),
         ("clf", knn)]

pipeline = pipe(steps)
pipeline.fit(X_train,y_train)
pipeline.predict(X_test)
pipeline.score(X_test,y_test)

0.8341463414634146